Ракович_В_Ю_70189466/src/Documents/Вакцинация/Вакцинация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вакцинация</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МедРаботник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Прививка</name>
    <type>
      <types>CatalogRef.Прививки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВакцинации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дозировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияВакцины</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Реакция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейВакцинации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВакцинации</types>
    </type>
  </attributes>
</mdclass:Document>

Ракович_В_Ю_70189466/src/InformationRegisters/КартаПрививок/КартаПрививок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КартаПрививок</name>
  <resources>
    <name>ДатаПрививки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Прививка</name>
    <type>
      <types>CatalogRef.Прививки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Ракович_В_Ю_70189466/src/Documents/Вакцинация/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // Регистр сведений "КартаПрививок"
    Если Статус = Перечисления.СтатусыВакцинации.Выполнена Тогда
        Запись = РегистрыСведений.КартаПрививок.СоздатьЗапись();
        Запись.Студент = Студент;
        Запись.Прививка = Прививка;
        Запись.ДатаВакцинации = Дата;
        Запись.СерияВакцины = СерияВакцины;
        Запись.Реакция = Реакция;
        Запись.Записать();
    КонецЕсли;
    
КонецПроцедуры
